//2019.11.1 昨天计算机组成腹肌，原理没考好，今天下午，测试复习Data Struture,好好 I am the best boy~
 
/*
	数据结构：数据结构与算法设计能力、程序设计与实现能力 
	计算机软、硬件系统的认知、分析、设计和应用能力 
	
	数据：是对客观事物的符号表示，在计算机科学中是所指能输入到计算机
	程序处理的符号的总称
	数据对象：性质相同的数据元素的集合，是一个数据的一个子集
	数据元素：是数据的基本单位，在计算机程序中通常作为一个整体而考虑和处理
	
	算法的五个特征：
		有穷性、确定性、可行性、0个或多个输入、1个或多个输出
	算法的设计要求：
		正确性、可读性、健壮性、高效率、低存储 
		
	f(n)一般用频度表达式中增长最快的项表示，并将其常数去掉 
	
	一个算法所需存储空间：
		1、算法本身的存储空间
		2、输入数据的存储空间
		3、算法在运行过程中临时占用包的存储空间
		若所需临时空间不随问题规模的大小而改变，则称此算法为原地工作 
		
		0 1 2 3 4
		
*/ 
#include<stdio.h>
int main(void){
	int i;
	for(i=0;i<9;i++);
	printf("%d\n",i);
	return 0;
} 

















